#!/usr/bin/env python3
# -*- coding: utf-8 -*-
import re
import jieba
import os
from passage import *

class comment_process():

    def __init__(self):
        self.stop_words = []
        self.read_stop_words()

    def read_stop_words(self):
        fp = open('variables/stopword.txt', 'rb')
        self.stop_words = fp.read().decode('utf-8').splitlines()

    def split_comment(self, comment, flag = True):
        if flag:
            params = jieba.cut(comment, cut_all=False)
            return list(params)
            ### print("精确模式: " + "| ".join(test2))
        else:
            params = set(jieba.cut(comment, cut_all=False))
            params = params - set(self.stop_words)
            return list(params)

    def cal_hanzi(self, _str):
        regex = re.compile(r'([\u4e00-\u9fa5]{1})')
        params = regex.findall(_str)
        return params

    def combine_sentence(self, params):
        split_pattern = re.compile('[！？。；\s(……)【】{}]')
        sentences = []
        vocs = []
        pre = 0
        for index in range(len(params)):
            if re.match(split_pattern, params[index]):
                temp = list(params[pre:index + 1])
                voc = list(set(temp) - set(self.stop_words))
                sen = ''.join(list(temp)).strip()
                if len(self.cal_hanzi(sen)) < 8:
                    continue
                pre = index + 1
                sentences.append(sen)
                vocs.append(' '.join(self.cal_hanzi(''.join(voc))))
        return sentences, vocs


if __name__ == '__main__':
    # proc = comment_process()
    # proc.cal_hanzi('如果没有耐心玩拼图，填字游戏诸如此类的，真的不要自虐了！')
    # os._exit(1024)
    # comment = '去年《大圣归来》引发了自来水现象，从票房到口碑真正实现双赢，一片喜乐掩盖了这部电影最大的短板：依然在消费《西游记》题材。角色当然有创新，故事当然有原创，但从面子到里子依然是旧瓶装新酒的把戏。所以对《大鱼海棠》的期待，是对它作为真正原创动画的期待。随着海报、预告的不断露出，过度模仿日系尤其是宫崎骏动画的批评声不断，但画风上的借鉴无伤大雅：毕竟，吉卜力的画风独步世界，而且那么美。动画片有自己的制作观念：大部分幻想动画，制作的第一步，就是设定世界观，整个故事发生的背景是如何，如果是虚幻世界，视觉样貌如何、运行法则如何、社会结构如何等等，而后便是角色设定，从人物小传到谱系关系，都需要作出清晰而完整的建构。说一部动画是原创，首先当是世界观必须原创。《大鱼海棠》明显参考了《千与千寻》等经典吉卜力动画，尤其是人设，可以说是日系风格，不过作为主场景的“其他人”家园，原型参考了福建客家土楼，这个借鉴十分成功，创造出和日系乡村风完全不同的景象。《大鱼海棠》的世界观通过椿的旁白说出：“所有人类的灵魂都是海里一条巨大的鱼，出生的时候从海的此岸出发，在路途中，有时相遇，有时分开，死的时候去到海的彼岸，之后变成一条沉睡的小鱼，等待多年后的再次出发，这个旅程永远不会结束，生命往复不息。”中国风，是《大鱼海棠》最初瞬间吸引无数观众的王牌，人设虽然日系，但从衣服到发型等细节，确实是中国传统风格。而且在角色名字上用了大量的古籍典故，甚至有堆砌之嫌：从三位主角椿、鲲、湫，到丿、毛人、帝江、鹿神、胤、珮、鲲妹、凤等等，从《庄子》到《山海经》、《列仙传》、《诗经》之中择选，用古典意味十足又相当生僻的汉字，来向观众宣告：这是一部完全中国民族风的作品。《庄子·逍遥游》中的“上古有大椿者，八千岁为春，八千岁为秋”，或许可以改作“上古有大椿者，八千岁为鲲，八千岁为湫”。鲲为了椿而死，椿向鲲还命，湫爱椿，愿意付出自己的生命，送椿去人世间，和化为人形的鲲重聚。关于生死，电影中大量对白都在点明：生与死互通，甚至可以交换，掌管好人灵魂的灵婆和掌管坏人灵魂的鼠婆都可以做这种交易。而掌管百草的椿爷爷丿，更是了悟生死——至少表面上、被创作者设定的是了悟生死，一副超然世外随时飞仙的形象，对孙女椿说些大彻大悟生死循环的话。可是，这些话可能仅仅是好看而唬人的幌子，《大鱼海棠》像个已然削发的尼姑，但凡心未泯，受到山下某个少年调戏便开始思凡。境界不到，身子先到。《大鱼海棠》的爱情戏离不开生死离别，但在整个故事生死观（作为“其他人”族群世界观的核心构成部分）肃穆宏达的基调下，显得过于轻薄了些。少男少女，为了所谓的爱，你死我活，谈不上悲剧色彩，勿论悲壮，更像是少年一时意气。《大鱼海棠》最令人讨厌的就是这一点，在故事还没讲好的情况下，把故事境界恨不得拔高到天际。每个角色，都是那么超然，一副得道神仙的派头，这让人心生抵触：里面的少年，骨子里其实是故作单纯的成年，里面的纯洁，是已忘初心的人幻想出来的纯洁。日系动画中，对男女爱情的处理通常都是轻描淡写，宫崎骏、高田勋的动画绝大多数都与爱情无关，即便有爱情元素，也决不会让少男少女说出“我好爱你”、“后悔那晚没有抱住你”这样的台词，即便有暧昧，也极含蓄，因为明目张胆地说出来，便是轻薄，因为破坏了最纯真的意蕴。近藤喜文的《侧耳倾听》，主题便是少年之爱，但表达之委婉含蓄，男女进退试探之妙，尽得东方古典之美。椿鲲湫之间的爱意纠葛，在剧情上严重缺乏说服力，可以看出创作者的用意，但用力不均，该浓墨重彩的寥寥带过，该蜻蜓点水的却停滞徘徊，比如椿与鲲一开始的感情渲染就不够，鲲属于大海之子，和鱼亲密无间，但和化为红海豚的鲲并没有实质性发展——而后直接跳到的情节就是鲲为椿甘愿身死，让人纳罕，随后椿不顾族群天规，贸然和灵婆做交易，用一半生命还给鲲，从此共生共死，椿之痴，近乎呆。湫对椿的感情，更是任性，从楼上望见雨夜疾行的椿，便一心所属，爱得不可收拾，宁愿以死成全佳人，感情发展的节奏非常不均衡，数次让观众尴尬。椿鲲湫，本来属于古典的美学世界中，说的话、做的事，却像我们这个时代恶心的青春爱情片做的事。这种落差让人极度不适。失恋的湫，喝醉了酒在悬崖边怒吼：你拒绝的是一个天神的爱情！——这等恶俗情节，和国产青春片有何不同？到底是何等的爱，才能不惜世界混乱海水倒灌，让种族遭遇灭顶之灾？而对观众来说，椿对鲲的感情只是报恩，说爱情都着实勉强。为了报恩，椿造成灾难，只能以死谢罪，幸运的是，法力有限的她，借助爷爷大树的力量，成功补天，堵住了海水，而后又莫名其妙地复活，继续用拖沓的节奏在鲲和湫之间爱恨纠葛。这段高潮戏本来大有可为，但情节线索有些混乱，尤其是灾难来临、灾难退去，诸多细节都未交待清楚。——而把重心放在了三个主角的生离死别上，椿与鲲依依不舍，极尽煽情之能事，终于送走了鲲，又紧接着开始了第二波离别，湫暗中和灵婆做了交易，牺牲自己，让椿去人间彼岸与鲲重逢，又开始油油腻腻地离别，再次要煽情——殊不知连塞两块甜点，观众已经腻了。全片的旁白者是已然苍老的椿，这段爱恨别离的往事在她的叙述中也并未拥有深厚的质感，因为三个主角的爱情戏陷在恶俗的泥淖中不得脱身。所以，我们一方面感受着超美的画面和配乐，一方面却为这些爱情戏皱眉：本来在往海立云垂磅礴壮观的美景深处去走，却老是生生被狗血的青春爱情元素拉回现实。此刻我们才明白，旁白的椿，不过是《泰坦尼克号》中耄耋年老的露丝。这部电影最大的败笔，是不知道从哪里学来一套幼稚可笑的青春爱情法则，把如此雄奇瑰丽的画面拉回“阳光下我们奔跑，夕阳里我们别离”的低俗境界。电影里出现大量的“生与死”的探讨，舍己救人，感恩还命，为爱献身，尤其是湫，完全是为了一丝执念而成人之美。这种三角恋的故事，讲好了，就是经典爱情，讲不好，就是狗血淋漓。说严重点，《大鱼海棠》属于内部溃烂，毁了一副好皮囊，古人所谓：金玉其外，败絮其中。真是令人扼腕叹息。儒雅优美的中国风，竟然被当代青春风给毁了。故事节奏的问题，无法掩盖画面的优点，毫无疑问，《大鱼海棠》是新世纪画面水准最好的国产动画，十二年磨出来的东西确实令人过目不忘。在动画制作中，有个“水火不容”的禁忌：水和火的场景最是耗时耗力，而《大鱼海棠》令人惊叹地毫不吝啬在这种技术难点上耕耘，一眼便能看出是良心制作。可惜，十二年只磨出来了中国风的面子。虽有遗憾，但依然支持《大鱼海棠》，跟情怀无关，而是只要对动画制作稍作了解（以前做过动画编剧），便知物力维艰，《大鱼海棠》在制作水准上将国产动画提升到前所未有的高度。不过，当一部电影让人说出“哎呀，画面还不错啦”的时候，真的挺失败的。'
    # comment_process.split_sentence(comment_process.split_comment(comment))

    proc = comment_process()
    for passage_index in range(0, 100, 10):
        print('正在处理第%d篇文章' % (passage_index))
        passage_list = Passage.select(passage_index, 10)
        for passage in passage_list:
            passage_id = passage['passage_id']
            print('passage_id', passage_id)
            passage_comment = passage['comment']
            ### split sentences
            params = proc.split_comment(passage_comment)
            sentences, vocs = proc.combine_sentence(params)
            for index in range(len(sentences)):
                # for voc in vocs[index]:
                #     Passage.execute_proc(passage_id, sentences[index], voc)
                # print(sentences[index], vocs[index])
                # os._exit(1024)
                Passage.execute_proc(passage_id, sentences[index], vocs[index])
